---
kind: method
id: M:Autodesk.Revit.DB.ReloadLatestOptions.Dispose
source: html/2a4e0236-c34e-5733-6ea9-4574a3af9b8f.htm
---
# Autodesk.Revit.DB.ReloadLatestOptions.Dispose Method

Releases all resources used by the ReloadLatestOptions

## Syntax (C#)
```csharp
public void Dispose()
```